tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "awscli"
brew "bat"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "helm"
brew "hugo"
brew "kubernetes-cli"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openssl"
brew "pandoc"
brew "pipenv"
brew "poetry"
brew "postgresql"
brew "pyenv"
brew "pylint"
brew "python"
brew "redis"
brew "ripgrep"
brew "rsnapshot"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "xz"
brew "yapf"
brew "yarn"
brew "youtube-dl"
brew "zlib"

# install fonts
tap "homebrew/cask-fonts"
cask "font-caskaydia-cove-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-noto-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-mono-nerd-font"
