tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "awscli"
brew "bat"
brew "boost"
brew "ccls"
brew "clang-format"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "doctl"
brew "ffmpeg"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "helm"
brew "hugo"
brew "kubernetes-cli"
brew "make"
brew "minio"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk"
brew "openssl"
brew "pandoc"
brew "pipenv"
brew "poetry"
brew "postgresql"
brew "prettier"
brew "pyenv"
brew "pylint"
brew "python"
brew "redis"
brew "ripgrep"
brew "rsnapshot"
brew "rust-analyzer"
brew "rustscan"
brew "rustup-init"
brew "sqlite"
brew "starship"
brew "tmux"
brew "tree"
brew "watch"
brew "xz"
brew "yapf"
brew "yarn"
brew "youtube-dl"
brew "zlib"

# install fonts
tap "homebrew/cask-fonts"
cask "font-caskaydia-cove-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-noto-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-mono-nerd-font"

# install casks
cask_args appdir: "~/Applications", require_sha: true
tap "homebrew/cask"
cask "alacritty"
cask "amethyst"
cask "blender"
cask "discord"
cask "epic-games"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "rectangle"
cask "sketch"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "textmate"
cask "visual-studio-code"
